app/Http/Livewire/DepartmentForm.php

    public function submit()
    {
        Department::create(['name' => $this->name]);
---
insert into `departments` (`name`, `tenant_id`, `updated_at`, `created_at`) values ('Accounting', 1, '2022-02-19 23:42:39', '2022-02-19 23:42:39')